Repository: Alex-bzh/python-M2ILTS
Catalog: data/XML/highwayman.tmx
Source language: en
Languages: fr

source: The wind was a torrent of darkness among the gusty trees
fr: Le vent déversait l'obscurité entre les arbres agités

source: The moon was a ghostly galleon tossed upon the cloudy seas
fr: La lune était un gallion fantôme Jeté sur une mer de nuages

source: The road was a ribbon of moonlight over the purple moor
fr: La route était un ruban de lune sur la colline pourpre

source: And the highwayman came riding,
fr: Et le vagabond chevauchait,

source: Riding, riding,
fr: Chevauchait,

source: The highwayman came riding, up to the old inn-door.
fr: Le vagabond chevauchait, jusqu'à la vieille auberge.

source: He'd a French cocked hat on his forehead, a bunch of lace at his chin,
fr: Il portait un chapeau à la française, lacet noué sous le menton,

source: A coat of claret velvet, and breeches of brown doe-skin;
fr: Un manteau de velours bordeaux, et des culottes de peau brune ;

source: They fitted with never a wrinkle; his boots were up to the thigh!
fr: Et elles ne faisaient jamais de plis ; ses bottes montaient jusqu'à mi-cuisse !

source: And he rode with a jewelled twinkle,
fr: Et il allait avec un joyau scintillant,

source: His pistol butts a-twinkle,
fr: La crosse de son pistolet, scintillante,

source: His rapier hilt a-twinkle, under the jewelled sky.
fr: Sa rapière, scintillante, sous le ciel de joyaux.

source: Over the cobbles he clattered and clashed in the dark innyard,
fr: Ses pas résonnèrent sur les pavés de la cour de l'auberge

source: And he tapped with his whip on the shutters, but all was locked and barred;
fr: Et il cogna aux volets avec son arme, mais tout était fermé et verrouillé ;

source: He whistled a tune to the window, and who should be waiting there
fr: Il siffla une note sous la fenêtre, pour celle qui devait attendre là

source: But the landlord's black-eyed daughter,
fr: Juste la fille de l'aubergiste,

source: Bess, the landlord's daughter,
fr: La jolie Bess aux yeux noirs,

source: Plaiting a dark red love-knot into her long black hair.
fr: Qui tressait à ses longs cheveux noirs un ruban rouge comme l'amour.

source: "One kiss, my bonny sweetheart, I'm after a prize tonight,
fr: "Un baiser, cher amour de mon coeur, ils sont après moi cette nuit,

source: But I shall be back with the yellow gold before the morning light;
fr: Mais Je reviendrai avec de l'or brillant avant l'aurore ;

source: Yet if they press me sharply, and harry me through the day,
fr: Sauf s'ils me serrent brusquement, et me poursuivent tout le jour,

source: Then look for me by the moonlight,
fr: Lors cherchez-moi au clair de lune,

source: Watch for me by the moonlight,
fr: Guettez-moi sous le clair de lune,

source: I'll come to thee by the moonlight, though hell should bar the way."
fr: Je viendrais à vous au clair de lune, quand bien même l'enfer me couperait la route."

source: He rose upright in the stirrups; he scarce could reach her hand
fr: Il se leva sur ses étriers ; il pouvait ainsi lui effleurer la main

source: But she loosened her hair i' the casement! His face burnt like a brand
fr: Mais elle laissa ses cheveux pendre par la croisée ! Son visage en fut brûlé

source: As the black cascade of perfume came tumbling over his breast;
fr: Lorsque la noire cascade de parfum se répandit sur lui ;

source: And he kissed its waves in the moonlight,
fr: Et il embrassa les boucles au clair de lune,

source: (Oh, sweet black waves in the moonlight!)
fr: (Ohh, douces boucles au clair de lune !)

source: Then he tugged at his rein in the moonlight, and galloped away to the west.
fr: Puis il fit claquer les rênes, et au clair de lune galopa loin vers l'est.

source: He did not come at the dawning; he did not come at noon,
fr: Il ne vint pas à l'aube ; il ne vint pas à midi,

source: And out of the tawny sunset, before the rise o' the moon,
fr: Et après le crépuscule fauve, avant que la lune ne se lève,

source: When the road was a gypsy's ribbon, looping the purple moor,
fr: Alors que la lune était un ruban de gitane, serpentant entre les colline pourpres,

source: A red-coat troop came marching,
fr: Une troupe de manteaux rouges vint marchant,

source: Marching, marching
fr: Marchant, marchant

source: King George's men came marching, up to the old inn-door.
fr: Les hommes du Roi George vinrent marchant, jusqu'à la vieille auberge.

source: They said no word to the landlord, they drank his ale instead,
fr: Ils ne dirent mot à l'aubergiste, à la place ils burent toute sa bière,

source: But they gagged his daughter and bound her to the foot of her narrow bed;
fr: Mais ils baillonèrent sa fille et l'attachèrent au pied de son lit étroit ;

source: Two of them knelt at the casement, with muskets at their side!
fr: Deux d'entre eux se postèrent aux croisées, mousquets au côté !

source: There was death at every window
fr: Il y avait la mort à chaque fenêtre,

source: And hell at one dark window;
fr: Et l'enfer à l'une sombre fenêtre ;

source: For Bess could see, through the casement,
fr: Pour Bess qui pouvait voir, à travers la croisée,

source: The road that he would ride.
fr: Le chemin qu'il prendrait.

source: They had tied her up to attention, with many a sniggering jest;
fr: Ils avaient capté son attention, avec des plaisanteries moqueuses ;

source: They had bound a musket beside her, with the barrel beneath her breast!
fr: Ils avaient attaché un mosquet derrière elle, le barillet sous son sein !

source: "Now keep good watch!" And they kissed her.
fr: "A présent regarde bien !" Et ils l'embrassèrent.

source: She heard the dead man say
fr: Elle entendit l'homme mort dire

source: "Look for me by the moonlight
fr: "Cherchez-moi au clair de lune

source: Watch for me by the moonlight
fr: Guettez-moi au clair de lune

source: I'll come to thee by the moonlight, though hell should bar the way!
fr: Je viendrais à vous au clair de lune, quand bien même l'enfer me couperait la route !"

source: She twisted her hands behind her, but all the knots held good!
fr: Elle tordait ses mains derrière elle, mais tous les noeuds tenaient bon !

source: She writhed her hands till her fingers were wet with sweat or blood!
fr: Elle tenta de les dégager, jusqu'à ce que ses doigts soient trempés de sueur et de sang !

source: They stretched and strained in the darkness and the hours crawled by like years!
fr: Ils s'étendirent là, attentifs dans l'obscurité et les heures semblaient durer des années !

source: Till, now, on the stroke of midnight
fr: Ainsi, jusqu'au coup de minuit,

source: Cold, on the stroke of midnight,
fr: Froid, sur le coup de minuit,

source: The tip of one finger touched it!
fr: Elle la toucha du bout du doigt !

source: The trigger at least was hers!
fr: La gâchette était enfin sienne !

source: Tlot-tlot! Had they heard it? The horse-hoofs were ringing clear
fr: Clop-clop ! L'avaient-ils entendu ? Les sabots claquaient clairement

source: Tlot-tlot, in the distance! Were they deaf that they did not hear?
fr: Clop-clop au loin ! Etaient-ils sourds pour ne pas entendre ?

source: Down the ribbon of moonlight, over the brow of the hill,
fr: Au bas du ruban de lune et au sommet de la colline,

source: The highwayman came riding
fr: Le vagabond chevauchait,

source: Riding, riding!
fr: Chevauchait, chevauchait !

source: The red-coats looked to their priming!
fr: Les manteaux rouges voyaient leur récompense !

source: She stood up straight and still!
fr: Elle se redressa et resta ainsi !

source: Tlot in the frosty silence! Tlot, in the echoing night!
fr: Clop dans le silence glacial ! Clop, dans la nuit résonnante !

source: Nearer he came and nearer! Her face was like a light!
fr: Plus près il venait, plus près ! Son visage était lumineux !

source: Her eyes grew wide for a moment! She drew one last deep breath
fr: Ses yeux s'agrandirent un moment ! Elle prit sa dernière bouffée d'air,

source: Then her finger moved in the moonlight,
fr: Puis son doigt bougea au clair de lune,

source: Her musket shattered the moonlight,
fr: Le mousquet transperça le clair de lune,

source: Shattered her breast in the moonlight and warned him with her death.
fr: Traversa sa poitrine au clair de lune, et l'avertit de sa mort.

source: He turned; he spurred to the west; he did not know she stood
fr: Il fit volte-face, à toute allure vers l'est ; il ne savait pas qu'elle restait

source: Bowed, with her head o'er the musket, drenched with her own red blood!
fr: Attachée, avec la tête au dessus de l'arme, imbibée de son sang écarlate !

source: Not till the dawn he heard it; his face grew grey to hear
fr: Il ne sut rien avant l'aurore ; son visage devint gris quand il apprit

source: How Bess, the landlord's daughter,
fr: Comment Bess, la fille de l'aubergiste,

source: The landlord's black-eyed daughter,
fr: La fille de l'aubergiste aux yeux noirs,

source: Had watched for her love in the moonlight, and died in the darkness there.
fr: Avait cherché son amour au clair de lune, et était morte dans les ténèbres.

source: Back, he spurred like a madman, shrieking a curse to the sky
fr: Au retour, il éperonnait comme un fou, maudissant le ciel

source: With the white road smoking behind him and his rapier brandished high!
fr: Sur la route blanche qui fumait derrière lui, il brandissait haut sa rapière !

source: Blood-red were the spurs i' the golden noon; wine-red was his velvet coat,
fr: Les éperons étaient rouges de sang sous le soleil doré de midi, rouges comme son manteau de velours,

source: When they shot him down on the highway,
fr: Quand ils l'abattirent sur le chemin,

source: Down like a dog on the highway,
fr: Sur le chemin comme un chien,

source: And he lay in his blood on the highway, with the bunch of lace at his throat.
fr: Et il baigna dans son sang sur le chemin, son chapeau noué sous le menton.

source: Still of a winter's night, they say, when the wind is in the trees,
fr: On dit depuis, que les nuits d'hiver où le vent fait hurler les arbres

source: When the moon is a ghostly galleon, tossed upon the cloudy seas,
fr: Quand la lune est un gallion fantôme, Jeté sur une mer de nuages,

source: When the road is a ribbon of moonlight over the purple moor,
fr: Quand la route est un ruban de lune sur la colline pourpre,

source: A highwayman comes riding,
fr: Un vagabond chevauche,

source: A highwayman comes riding, up to the old inn-door
fr: Le vagabond chevauche, jusqu'à la vieille auberge.
